{
  "_name_or_path": "./results/Rostlab/prot_bert_bfd/SS8-512/prot_bert_bfd/checkpoint-1011",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "G",
    "1": "T",
    "2": "E",
    "3": "C",
    "4": "I",
    "5": "B",
    "6": "H",
    "7": "S"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B": 5,
    "C": 3,
    "E": 2,
    "G": 0,
    "H": 6,
    "I": 4,
    "S": 7,
    "T": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 40000,
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 30,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 30
}
